app/controllers/blogs_controller.rb

INSERT INTO `blogs` (`updated_at`, `title`, `private`, `archived`, `created_at`) VALUES('2009-10-27 22:32:38', 'Rails', NULL, NULL, '2009-10-27 22:32:38')
---
  def create
    @blog = Blog.new(params[:blog])
    if @blog.save

SELECT * FROM `blogs`
---
  def index
    @blogs = Blog.all

SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)
---
  def show
    @blog = Blog.find(params[:id])