app/controllers/photos_controller.rb

INSERT INTO `photos` (`updated_at`, `photo_file_file_name`, `title`, `public`, `photo_file_file_size`, `featured`, `parent_type`, `photo_file_content_type`, `photo_file_updated_at`, `owner_id`, `parent_id`, `created_at`) VALUES('2009-10-27 22:47:25', NULL, 'Dun Bug with Cake', NULL, NULL, NULL, 'PhotoGallery', NULL, NULL, 1, 1, '2009-10-27 22:47:25')
---
  def create
    @photo = Photo.create(params[:photo])

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def edit
    @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
UPDATE `photos` SET `photo_content_type` = 'image/jpeg', `updated_at` = '2009-10-27 22:55:41', `photo_file_size` = 2365113, `photo_file_name` = 'IMG_5520.jpg' WHERE `id` = 2
---
  def update

    @photo = Photo.find(params[:id])
    if @photo.update_attributes(params[:photo])

SELECT * FROM `photos`
---
  def index
    @photos = Photo.all

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def show
    @photo = Photo.find(params[:id])