app/controllers/photo_galleries_controller.rb

INSERT INTO `photo_galleries` (`updated_at`, `title`, `body`, `private`, `archived`, `owner_id`, `created_at`) VALUES('2009-10-27 22:39:27', 'Portraits', '', NULL, NULL, 1, '2009-10-27 22:39:27')
---
  def create
    @photo_gallery = PhotoGallery.new(params[:photo_gallery])
    if @photo_gallery.save

SELECT * FROM `photo_galleries`
---
  def index
    @photo_galleries = PhotoGallery.all

SELECT * FROM `photo_galleries` WHERE (`photo_galleries`.`id` = 1)
---
  def show
    @photo_gallery = PhotoGallery.find(params[:id])