app/controllers/users_controller.rb

INSERT INTO `users` (`last_request_at`, `updated_at`, `crypted_password`, `username`, `persistence_token`, `first_name`, `password`, `last_name`, `email`, `created_at`) VALUES('2009-10-27 22:30:23', '2009-10-27 22:30:23', 'e39395013d3aef4fe056769989f29be1fe42a7c74bef2fdb8165588e25f908662bc19d545a692a6a153cc4e4ec41b7223913611bbcce0f60ed9f2cccd496d656', 'jmoline', 'a94f6256f50d2dddd3b0a08f93f68c1fa5fe435aaab83b1795abf004e7964afd853f82035e2ee034128abe5d038924bf4b51e50a096d74936eb67a4809742ff7', NULL, NULL, NULL, 'jmoline@gmail.com', '2009-10-27 22:30:23')
---
  def create
    @user = User.new(params[:user])
    if @user.save